wonseob/jk-stm32f103-dragon/sw/all_demo/lcd28.c
#ifdef LCD28_DBG_LOG
	usart1_transmit_string("\r\nlcd28_clear_screen()\r\n");
#endif

	// 2.8 lcd backlight on
	LCD_PWM_LIGHT_LOW(); //--> 2.8 LCD original code	

	delay_ms(20);

	lcd28_clear_screen(RED);

}


// starts to write GRAM
void lcd28_writeram_prepare(void)
{
	lcd_wr_reg(R34);
}	 

void lcd28_setcursor (u8 Xpos, u16 Ypos)
{
	lcd_wr_reg_value (R32, Xpos);
	lcd_wr_reg_value (R33, Ypos);
} 

// 320 * 240
void lcd28_clear_screen(unsigned int color)
{                    
	u32 index=0;      
	lcd28_setcursor(0x00,0x0000); // establishment cursor position 
	lcd28_writeram_prepare();     // starts to read in GRAM	 	  
	for (index=0; index<320*240; index++)
	{
		lcd_wr_data(color);    
	}
}

void lcd28_draw_point (u16 x, u16 y)
{
	lcd28_setcursor(x, y); // establishment cursor position 
	lcd_wr_reg(R34); // starts to read in GRAM
	lcd_wr_data(POINT_COLOR); 
} 	

void lcd28_fill_color(u8 xsta, u16 ysta, u8 xend, u16 yend, u16 color)
{                    
    u32 n;
	// establishment window										
	lcd_wr_reg_value (R80, xsta); // horizontal direction GRAM start address
	lcd_wr_reg_value (R81, xend); // horizontal direction GRAM end address
	lcd_wr_reg_value (R82, ysta); // vertical direction GRAM start address
	lcd_wr_reg_value (R83, yend); // vertical direction GRAM end address	
	lcd28_setcursor(xsta, ysta); // establishment cursor position  
	lcd28_writeram_prepare();  // starts to read in GRAM	 	   	   
	n=(u32)(yend-ysta+1)*(xend-xsta+1);    
	while (n--) {lcd_wr_data(color);}// demonstration fills color. 
	// resumes the establishment
	lcd_wr_reg_value (R80, 0x0000); // horizontal direction GRAM start address
	lcd_wr_reg_value (R81, 0x00EF); // horizontal direction GRAM end address
	lcd_wr_reg_value (R82, 0x0000); // vertical direction GRAM start address
	lcd_wr_reg_value (R83, 0x013F); // vertical direction GRAM end address	    
}  

// draws a line
//x1, y1: Beginning coordinates
//x2, y2: End point coordinates  
void lcd28_draw_line (u16 x1, u16 y1, u16 x2, u16 y2)
{
	u16 t; 
	int xerr=0, yerr=0, delta_x, delta_y, distance; 
	int incx, incy, uRow, uCol; 

	delta_x=x2-x1; // computation increase of coordinates 
	delta_y=y2-y1; 
	uRow=x1; 
	uCol=y1; 
	if(delta_x>0)incx=1; // establishes on foot the direction 
	else if(delta_x==0)incx=0; // perpendicular line 
	else {incx=-1; delta_x=-delta_x;} 
	if(delta_y>0)incy=1; 
	else if(delta_y==0)incy=0; // level line 
	else {incy=-1; delta_y=-delta_y;} 
	if (delta_x>delta_y) distance=delta_x; // selects the basic increase coordinate axis 
	else distance=delta_y; 
	for (t=0; t<=distance+1; t++) // linedraw output 
	{  
		lcd28_draw_point(uRow, uCol); // picture spot 
		xerr+=delta_x; 
		yerr+=delta_y; 
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance; 
			uCol+=incy; 
		} 
	}  
}    
// picture rectangle
void lcd28_draw_rectangle (u8 x1, u16 y1, u8 x2, u16 y2)
{
	lcd28_draw_line(x1, y1, x2, y1);
	lcd28_draw_line(x1, y1, x1, y2);
	lcd28_draw_line(x1, y2, x2, y2);
	lcd28_draw_line(x2, y1, x2, y2);
}
// is assigning the position to draw one to assign the size the circle
// (x, y): Central point
//r: Radius
void lcd28_draw_circle(u8 x0, u16 y0, u8 r)
{
	int a, b;
	int di;
	a=0; b=r;	  
	di=3-(r<<1);             // judgment spot position symbol
	while(a<=b)
	{
		lcd28_draw_point(x0-b, y0-a);             //3           
		lcd28_draw_point(x0+b, y0-a);             //0           
		lcd28_draw_point(x0-a, y0+b);             //1       
		lcd28_draw_point(x0-b, y0-a);             //7           
		lcd28_draw_point(x0-a, y0-b);             //2             
		lcd28_draw_point(x0+b, y0+a);             //4               
		lcd28_draw_point(x0+a, y0-b);             //5
		lcd28_draw_point(x0+a, y0+b);             //6 
		lcd28_draw_point(x0-b, y0+a);             
		a++;
		// uses the Bresenham algorithm to make a circle     
		if(di<0)di +=4*a+6;	  
		else
		{
			di+=10+4*(a-b);   
			b--;
		} 
		lcd28_draw_point(x0+a, y0+b);
	}
} 
// is assigning the position to demonstrate a character
//x: 0~234
//y: 0~308
//num: Must demonstrate character: ""---> " ~"
//size: Font size 12/16
//mode: The superimposition way (1) is also the non-superimposition way (0)
void lcd28_show_char (u8 x, u16 y, u8 num, u8 size, u8 mode)
{       

#define MAX_CHAR28_POSX 232
#define MAX_CHAR28_POSY 304 

    u8 temp;
    u8 pos, t;      

    if(x>MAX_CHAR28_POSX || y>MAX_CHAR28_POSY)
		return;	    

	// establishment window										
	lcd_wr_reg_value(R80, x);           // horizontal direction GRAM start address
	lcd_wr_reg_value(R81, x+(size/2-1)); // horizontal direction GRAM end address
	lcd_wr_reg_value(R82, y);           // vertical direction GRAM start address
	lcd_wr_reg_value(R83, y+size-1);    // vertical direction GRAM end address	
	lcd28_setcursor(x, y);            // establishment cursor position  
	lcd28_writeram_prepare();        // starts to read in GRAM	   
	num = num - ' '; // obtains the displacement value
	if (!mode) // non-superimposition way
	{
		for (pos=0; pos<size; pos++)
		{
			if(size==12)temp=asc2_1206[num][pos]; // transfers 1206 typefaces
			else temp=asc2_1608[num][pos];		 // transfers 1608 typefaces
			for (t=0; t<size/2; t++)
		    {                 
		        if(temp&0x01)
				{
					lcd_wr_data(POINT_COLOR);
				} else lcd_wr_data(BACK_COLOR);	        
		        temp>>=1; 
		    }
		}	
	} else//superimposition way
	{
		for (pos=0; pos<size; pos++)
		{
			if(size==12)temp=asc2_1206[num][pos]; // transfers 1206 typefaces
			else temp=asc2_1608[num][pos];		 // transfers 1608 typefaces
			for (t=0; t<size/2; t++)
		    {                 
		        if(temp&0x01)lcd28_draw_point(x+t, y+pos); // draws a spot     
		        temp>>=1; 
		    }
		}
	}	    
	// restores the window size	 
	lcd_wr_reg_value (R80, 0x0000); // horizontal direction GRAM start address
	lcd_wr_reg_value (R81, 0x00EF); // horizontal direction GRAM end address
	lcd_wr_reg_value (R82, 0x0000); // vertical direction GRAM start address
	lcd_wr_reg_value (R83, 0x013F); // vertical direction GRAM end address
}  


// demonstrates 2 numerals
//x, y: Beginning coordinates	 
//len: Digital figure
//size: Font size
//color: Color
//num: Value (0~4294967295);	 
void lcd28_show_num(u8 x, u16 y, u32 num, u8 len, u8 size)
{         	
	u8 t, temp;
	u8 enshow=0;						   
	for (t=0; t<len; t++)
	{
		temp=(num/mypow(10, len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				lcd28_show_char(x+(size/2) *t, y, ' ', size,0);
				continue;
			} else enshow=1; 
		 	 
		}
	 	lcd28_show_char(x+(size/2) *t, y, temp+'0', size,0); 
	}
} 

// demonstration string of character
//x, y: Beginning coordinates  
// *p: String of character start address
// uses 16 typefaces
void lcd28_show_string (u8 x, u16 y, const u8 *p)
{         
    while (*p != '\0')
    {       
        if(x>MAX_CHAR28_POSX) 
		{
			x=0; 
			y+=16;
		}
        
		if(y>MAX_CHAR28_POSY) 
		{
			y=x=0; 
			lcd28_clear_screen(WHITE);
		}

        lcd28_show_char(x, y,*p,16,0);
        x+=8;
        p++;
    }  
}

void lcd28_draw_point_big(u16 x,u16 y)
{
	lcd28_draw_point(x,y);
	lcd28_draw_point(x+1,y);
	lcd28_draw_point(x,y+1);
	lcd28_draw_point(x+1,y+1);
}
